import React from 'react';
import '../styles/Lesya.css';
import LesyaBooks from '../data/LesyaBooks';
import { Link } from 'react-router-dom';

function Lesya() {
  return (
    <div className="bio-container">
      <img src="/Authors/Lesya.jpg" alt="Леся Українка" className="portrait"/>
      <h2>Леся Українка (1871–1913)</h2>
      <p className='subtitle'>Українська поетеса, письменниця, драматург, перекладач</p>
      <p>
        Леся Українка (справжнє ім'я – Лариса Петрівна Косач) народилася 25 лютого 1871 року в містечку Новоград-Волинськ. 
      </p>
      <p>
        У колі сім'ї її називали Лесею, тож цей милозвучний варіант імені й закріпився за нею. 
      </p>
      <p>
        Псевдонім «Українка» з'явився у 1884 році, коли дівчинці було тринадцять років і вона опублікувала свої перші вірші. Такий псевдонім вона запозичила у свого дядька – письменника і вченого-історика Михайла Драгоманова, якого дуже любила і хотіла бути в чомусь схожою з ним (Драгоманов часто підписував свої твори псевдонімом «Українець»). 
      </p>
      <p>
        Її батько – Петро Антонович Косач був дворянином, поміщиком, юристом за фахом, меценатом, громадським діячем, мав звання дійсного статського радника. 
      </p>
      <p>
        Мати – Драгоманова-Косач Ольга Петрівна, походила  з дрібнопомісних дворян Полтавської губернії; українська письменниця (її псевдонім – Олена Пчілка), фольклорист та етнограф, громадська діячка.
      </p>
      <p>
        Дитячі роки майбутньої поетеси минали на Поліссі – взимку Косачі жили в Луцьку, а літом – у селі Колодяжне. Інтелігентне середовище, у якому жила і виховувалася Леся, з ранніх літ сприяло розвитку її здібностей. 
      </p>
      <p>
        Вона навчилася читати в 4 роки, у 5 – уже вміла писати, грала на роялі, у 6 – гарно вишивала, у 9 написала перший вірш – «Надія», у 13 років почала публікувати свої поезії, у 14 років написала першу поему – «Русалка» й переклала Гоголівські «Вечори на хуторі біля Диканьки», у 19 – створила підручник «Стародавня історія східних народів» для  молодших сестер, а у 22 – за сприяння Івана Франка – видала першу поетичну збірку «На крилах пісень» накладом 500 примірників. 
      </p>
      <p>
        Пізніше вона підкреслювала: «Мені легко було вийти на літературний шлях, бо я з літературної родини походжу, але від того не менше кололи мене поетичні терни».
      </p>
      <p>
        Сталося так, що Леся ніколи не навчалася в жодному навчальному закладі. У січні 1881 року, коли дівчинці було 9 років, вона з братом Михайлом пішла на річку Стир подивитися, як святять воду, застудилася і захворіла. Ця хвороба дала ускладнення. Пізніше виявилося, що в неї – туберкульоз кісток. 
      </p>
      <p>
        Відтоді почалася, як говорила сама Леся, «тридцятилітня війна» з тяжкою невиліковною на той час хворобою. Дівчина вчилася вдома самостійно за програмою, складеною батьками, і з приватними учителями. Скільки жила, продовжувала цікавитися й наполегливо опановувати різні науки, дуже багато читати. 
      </p>
      <p>
        Протягом життя вона оволоділа в різній мірі 11 іноземними мовами: окрім рідної – української, вона вільно розмовляла французькою, німецькою, італійською, польською, болгарською і російською мовами, розуміла грузинську, латину та давньогрецьку мову. 
      </p>
      <p>
        Письменник Михайло Павлик у листі до дядька Лесі – Михайла Драгоманова писав: «Леся просто приголомшила мене своєю освіченістю й тонким розумом. Я думав, що вона живе лише поезією, але це далеко не так. На свій вік це геніальна жінка… в кожнім її слові я бачив розум та глибоке розуміння поезії, науки, освіти та людського життя».
      </p>
      <p>
        З 1888 по 1889 рік, перебуваючи у Києві, Леся Українка разом із сестрою Ольгою відвідувала публічні лекції в Київському університеті й приймала активну участь у роботі літературного гуртка української молоді «Плеяда». У 1891 році відбулася її перша зарубіжна подорож, зустріч з Іваном Франком та іншими письменниками й культурно-політичними діячами Галичини. У 1893 році у Львові за сприяння І. Франка вийшла у світ перша збірка поезій Лесі Українки – «На крилах пісень». З 1894 по 1895 рік вона проживала в Болгарії у свого дядька Михайла Драгоманова й впорядкувала його велику бібліотеку. 
      </p>
      <p>
        У серпні 1899 року, після тривалого дружнього листування з письменницею Ольгою Кобилянською, відбулася їхня зустріч. У 1901 році Леся Українка взяла на свої плечі страшний труд: доглядати до самої смерті хворого на сухоти коханого – революціонера Сергія Мержинського. Про це існує багато легенд. Одна з них розповідає, що поему «Одержима» поетеса написала в ту ніч, коли коханий помер і вона сама сиділа коло нього до ранку.
      </p>
      <p>
        Про Лесю Українку особливо піклувався фольклорист Климентій Квітка. 7 серпня 1907  вони офіційно оформили шлюб – обвінчалися у церкві й оселилися у Києві, а 21 серпня разом переїхали до Криму, де Квітка одержав посаду в суді. 
      </p>
      <p>
        Стан здоров’я поетеси погіршився і лікарі радили їхати на лікування до Єгипту, але зібрані на поїздку гроші (365 австрійських крон) подружжя витратило у 1908 році на організацію етнографічної експедиції, яка здійснила запис мелодій українських народних дум та пісень. Саме тоді за ці кошти можна було придбати невеликий будинок. Грошовий збір від поставленої в січні 1909 року в Києві драми Лесі Українки «Блакитна троянда» був переданий на пам’ятник Т. Шевченку.
      </p>
      <p>
        Останні роки життя – з 1910 по 1913 рік, Леся Українка провела в подорожах до Єгипту й на Кавказ з метою лікування. Незважаючи на страждання від прогресуючої хвороби, вона знаходила в собі сили для зібрання фольклору, яке проводила разом із чоловіком, інтенсивно редагувала уже написані драми. 
      </p>
      <p>
        28 квітня 1913 року востаннє приїхала до Києва, щоб бути на присвяченому їй творчому вечорі в клубі «Родина», а у травні – повернулася в Кутаїсі. На звістку про важкий стан дочки в Грузію приїхала мати та сестра Ольга. Саме для них Леся Українка продиктувала зміст своєї так і ненаписаної драми «На берегах Александрії».
      </p>
      <p>
        19 липня між першою і другою годиною ночі Леся Українка померла. Труну з прахом поетеси привезли до Києва 26 липня 1913 року й поховали на Байковому кладовищі. 
      </p>
      <p>
        Під час прощальної церемонії поліція не дозволила ні промов, ні співів. За труною йшов багатотисячний натовп, і щоб ніхто не посмів порушити заборону, похоронну процесію супроводжував наряд кінноти і піших жандармів. 
      </p>
      <p>
        Родичка Лесі Українки, письменниця і громадська діячка Людмила Старицька дуже влучно відгукнулася на смерть поетеси: «Українська література втратила з нею одного з найбільших поетів життя, втеряла душу, яка рідко коли пробуває на землі».
      </p>

      <h3 className="books-title">Книги:</h3>
            
            <div className="books-row">
            {LesyaBooks.books.map(book => (
            <Link key={book.id} to={`/poet/Lesya/book/${book.id}`} className="book-card">
            <img src={book.image} alt={book.title} className="book-img" />
            <h4>{book.title}</h4>
            <p>{book.description}</p>
            </Link>
            ))}
            </div>
    </div>
  );
}

export default Lesya;
