const FrancoBooks = {
  name: 'Книги:',
  books: [
    {
      id: 1,
      title: 'Захар Беркут',
      description: 'Історична повість про боротьбу українців з монголами.',
      content: 'Захар Беркут — це історична повість Івана Франка, що розповідає про героїчну боротьбу карпатських громад з монгольськими загарбниками в XIII столітті. Головна тема — єдність народу, самопожертва заради спільного добра та сила громади.',
      image: '/Books/Zahar.jpg',
    },
    {
      id: 2,
      title: 'Мойсей',
      description: 'Філософська поема-алегорія.',
      content: 'Мойсей — це філософська поема Івана Франка, що виступає як алегорія про роль духовного провідника в історії нації. Вона досліджує теми зради, віри, сумніву та долі народу.',
      image: '/Books/Mojsej.jpg',
    },
    {
      id: 3,
      title: 'Лис Микита',
      description: 'Гумористична поема-байка про хитрого лиса.',
      content: 'Лис Микита — це сатирична поема Івана Франка, написана у формі байки. Головний герой — хитрий і спритний лис, який вміло використовує свої розумові здібності, щоб вижити у світі повному підступів. Твір висміює людські вади — жадібність, лицемірство, зраду — через алегоричні образи тварин.',
      image: '/Books/Mikita.jpg',
    },
  ],
};

export default FrancoBooks;
