const LesyaBooks = {
  name: 'Книги:',
  books: [
    {
      id: 1,
      title: 'Лісова пісня',
      description: 'Фантастична драма-феєрія.',
      content: 'Лісова пісня — це один з найвідоміших творів Лесі Українки. Це драматична поема про кохання людини й лісової мавки, що символізує боротьбу духовного й матеріального. Глибокий філософський підтекст і поетичність роблять цей твір шедевром української літератури.',
      image: '/Books/Lisova.jpg',
    },
    {
      id: 2,
      title: 'Contra spem spero!',
      description: 'Вірш про надію всупереч усьому',
      content: 'Contra spem spero! — це один із найсильніших ліричних віршів Лесі Українки. Назва перекладається з латини як «Без надії сподіваюсь. У творі авторка виражає віру в життя, боротьбу й силу духу навіть у найскладніших обставинах. Це гімн незламності волі та надії.',
      image: '/Books/Spem.jpg',
    },
    {
      id: 3,
      title: 'Одержима',
      description: 'Філософська драма про свободу мистецтва',
      content: 'Одержима — це драматичний твір, написаний у формі монологів, натхненний біблійними мотивами. Леся Українка створила цей твір під час хвороби, буквально на межі життя і смерті. У центрі — внутрішня боротьба героїні, її віра, сумніви і духовний біль. Це глибока психологічна драма, сповнена експресії та трагізму.',
      image: '/Books/Oderjima.jpg',
    },
  ],
};

export default LesyaBooks;
