const TarasBooks = {

  name: 'Книги:',
  books: [
    {
      id: 1,
      title: 'Книга "Кобзар"',
      description: 'Кобзар — головна книга Шевченка.',
      content: 'Кобзар – це знаменита збірка поезій, поем та інших творів українського поета Тараса Шевченка. Він є одним із найважливіших творів української літератури та культури. Кобзар включає твори різних років, обьєднаних темою любові до України, її історії, народу і природи, а також протестом проти соціальної несправедливості та кріпацтва.',
      image: '/Books/BookKobzar.jpg',
    },
    {
      id: 2,
      title: 'Гайдамаки',
      description: 'Історична поема',
      content: 'Гайдамаки — це поема Тараса Шевченка, Катерина є важливим твором у контексті дослідження жіночої долі в кріпацтві. Вона зображує трагедію молодої жінки, яка зазнала зради та соціального осуду після народження позашлюбної дитини від російського солдата. Катерина стає символом жінки-покритки, зневаженої та покинутої суспільством, яке не прощає їй відхилень від норм.',
      image: '/Books/haidamaky.jpg',
    },
    {
      id: 3,
      title: 'Катерина',
      description: 'Трагічна історія жінки',
      content: 'Катерина — це Поема Тараса Шевченка "Катерина" є важливим твором у контексті дослідження жіночої долі у кріпацтві. Вона зображує трагедію молодої жінки, яка зазнала зради та соціального осуду після народження позашлюбної дитини від російського солдата. Катерина стає символом жінки-покритки, зневаженої та покинутої обществом, яке не прощає їй відхилень від норм.',
      image: '/Books/kateryna.jpg',
    },
  ],
};

export default TarasBooks;
